In [ ]:
!pip install pandas
!pip install numpy
!pip install matplotlib
!pip install seaborn

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv("amazon_categories.csv")

In [6]:
df

      id                                    category_name
0      1                         Beading & Jewelry Making
1      2                                Fabric Decorating
2      3                      Knitting & Crochet Supplies
3      4                             Printmaking Supplies
4      5                 Scrapbooking & Stamping Supplies
..   ...                                              ...
243  262  Xbox Series X & S Consoles, Games & Accessories
244  263                           PC Games & Accessories
245  264                     Baby Girls' Clothing & Shoes
246  265                            Boys' School Uniforms
247  270                                     Toys & Games

[248 rows x 2 columns]

In [7]:
df.shape

(248, 2)

In [11]:
df.describe()

               id
count  248.000000
mean   133.875000
std     77.132441
min      1.000000
25%     67.500000
50%    137.500000
75%    199.250000
max    270.000000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             248 non-null    int64
 1   category_name  248 non-null    object
dtypes: int64(1), object(1)
memory usage: 4.0+ KB

THIS IS A DEMO PROJECT